Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: One thing to note is that the live reload feature is not available when making changes to both Java and Kotlin source that have dependencies on each other. We hope to alleviate this limitation in the future.
zh_cn: 有一点需要注意的是，当对相互有依赖关系的Java和Kotlin源代码进行修改时，实时重载功能是不可用的。我们希望在未来能缓解这一限制。

source: Open Source Utterly and Absolutely
zh_cn: 完全和绝对地开放源代码

source: Open `http://localhost:8080/quotes.html` in your browser and request some quotes by clicking the button.
zh_cn: 在你的浏览器中打开 `http://localhost:8080/quotes.html` ，点击按钮来请求一些报价。

source: Open a browser to http://localhost:8080/legumes.html and you will see our list of legumes.
zh_cn: 打开浏览器访问 http://localhost:8080/legumes.html ，你会看到我们的legumes列表内容。

source: Open a xref:dev-ui.adoc[Dev UI] available at http://localhost:8080/q/dev[/q/dev] and click on a `Provider: Keycloak` link in an `OpenID Connect` `Dev UI` card.
zh_cn: 打开 link:http://localhost:8080/q/dev[/q/dev] 提供的 link:dev-ui.html[开发用户界面] ，点击 `OpenID Connect` `Dev UI` 卡片中的 `Provider: Keycloak` 链接。

source: Open another terminal and run the `curl http://localhost:8080/increments` command.
zh_cn: 打开另一个终端，运行 `curl http://localhost:8080/increments` 命令。

source: Open http://localhost:8080/fruits to invoke this method:
zh_cn: 打开 http://localhost:8080/fruits 调用这个方法：

source: Open src/main/resources/application.properties and add the following line to enable SSL in your native image.
zh_cn: 打开src/main/resources/application.properties，并在你的原生镜像中添加以下行来启用SSL。

source: Open the two projects in your favorite IDE.
zh_cn: 在你喜欢的IDE中打开这两个项目。

source: Open your browser to http://localhost:8080/greeting.
zh_cn: 打开你的浏览器并访问 http://localhost:8080/greeting。

source: Open your favorite terminal and use JBang to install the Quarkus CLI. You do not need to have Java installed first.
zh_cn: 打开您喜欢的终端并使用JBang安装Quarkus CLI。您不需要首先安装Java。

source: OpenID Connect (OIDC) Dev Services
zh_cn: OpenID Connect（OIDC）开发服务

source: OpenID Connect (OIDC) is an identity layer that works on top of the OAuth 2.0 protocol. OIDC enables client applications to verify the identity of a user based on the authentication performed by the OIDC provider and to retrieve basic information about that user.
zh_cn: OpenID Connect（OIDC）是一个身份层，它工作在OAuth 2.0协议之上。OIDC使客户端应用程序能够根据OIDC提供者进行的认证来验证用户的身份，并获取用户的基本信息。

source: OpenTelemetry Configuration Reference
zh_cn: OpenTelemetry参考配置

source: OpenTelemetry propagates cross-cutting concerns through https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/context/api-propagators.md[propagators] that will share an underlying `Context` for storing state and accesing data across the lifespan of a distributed transaction.
zh_cn: OpenTelemetry通过 link:https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/context/api-propagators.md[propagators] 来传播横切关注点(cross-cutting concerns)，这些 link:https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/context/api-propagators.md[propagators] 将共享一个底层 `Context` ，用于在分布式事务的生命周期内存储状态和访问数据。

source: Opinionated
zh_cn: 有态度的

source: Optional gRPC headers commonly used for authentication
zh_cn: 可选的gRPC消息头，通常用于认证

source: Optional values
zh_cn: 可选值

source: Optionally Mandrel or GraalVM installed and xref:building-native-image.adoc#configuring-graalvm[configured appropriately] if you want to build a native executable (or Docker if you use a native container build)
zh_cn: 如果你想构建原生可执行程序，可以选择安装Mandrel或者GraalVM，并xref:building-native-image.adoc#configuring-graalvm[正确配置](或者使用Docker在容器中进行构建)

source: Optionally get <a href="https://www.graalvm.org/" target="_blank">GraalVM</a> {{ site.data.versions.graalvm }} for native compilation
zh_cn: 可选择获取<a href="https://www.graalvm.org/" target="_blank">GraalVM</a> {{ site.data.version.graalvm }}进行原生编译

source: Optionally the xref:cli-tooling.adoc[Quarkus CLI] if you want to use it
zh_cn: 如果你愿意的话，还可以选择使用xref:cli-tooling.adoc[Quarkus CLI]

source: Optionally, use the `@MongoEntity` annotation to specify the name of the collection, the name of the database or the name of the client.
zh_cn: 可以选择使用 `@MongoEntity` 注解来指定集合的名称、数据库的名称或客户端的名称。

source: Or by name using a `Map`:
zh_cn: 或者使用 `Map` ，按名字来命名：

source: Or have the listener’s name be the same as the group id:
zh_cn: 或者令监听器的名字与消费者组的ID相同：

source: Or in `application.yml`:
zh_cn: 或者在 `application.yml` ：

source: Or just add the following dependency to your project:
zh_cn: 或者只需在你的项目中添加以下依赖项：

source: Or start `gdb` with:
zh_cn: 或这样运行 `gdb` 命令：

source: Or take a look into the World of Warcraft Auctions - Batch Application. It downloads the World of Warcraft Auction House data and provides statistics about items prices.
zh_cn: 或者看看《魔兽世界》的拍卖 - 批处理应用。它下载魔兽世界拍卖行的数据并提供物品价格的统计数据。

source: Or using the convenience class `Parameters` either as is or to build a `Map`:
zh_cn: 或者使用方便的类 `Parameters` ，既可以是原样，也可以是建立一个 `Map` 。

source: Or, if you packaged your application as native executable, use:
zh_cn: 或者，如果你将你的应用打包为原生可执行文件，使用：

source: Or, you can also install the CLI with SDKMAN!
zh_cn: 或者，您也可以用SDKMAN安装CLI！

source: Or, you can retrieve the Message<Double>:
zh_cn: 或者，你可以检索Message<Double>。

source: Oracle Client
zh_cn: Oracle客户端

source: Other resources should be declared explicitly.
zh_cn: 其他资源应明确声明。

source: Other than method signatures returning a Reactive Stream `Publisher` (`Multi` being an implementation of `Publisher`), outgoing method can also return single message. In this case the producer will use this method as generator to create an infinite stream.
zh_cn: 除了返回Reactive Stream `Publisher` ( `Multi` 实现了 `Publisher` )的方法签名外，发送方法也可以返回单个消息。在这种情况下，生产者将使用该方法作为生成器来创建一个无限的流(infinite stream)。

source: Our dependency injection solution is based on CDI. You can use JAX-RS annotations to define the REST endpoints. You can use JPA annotations to map your persistent entities and JTA annotations to declare the transaction boundaries. You can use Eclipse MicroProfile to configure and monitor your application. You can use Vert.x, Apache Camel and we support much more.
zh_cn: 我们的依赖注入方案是基于CDI的。可以使用JAX-RS注解定义REST端点。您可以使用JPA注解来映射持久实体，使用JTA注解来声明事务边界。可以使用Eclipse MicroProfile配置和监视应用程序。你可以使用Vert.x, Apache Camel，我们还支持更多。

source: Our monthly newsletters bring together articles, videos and perspectives from across the Quarkus community.
zh_cn: 我们的每月通讯汇集了来自整个Quarkus社区的文章、视频和观点。

source: Outbound Metadata
zh_cn: 出站元数据

source: Outgoing Attributes of the 'smallrye-kafka' connector
zh_cn: 'smallrye-kafka' 连接器的传出属性

source: Outgoing channel configuration
zh_cn: 传出通道配置

source: Outgoing channel configuration (writing to Kafka)
zh_cn: 出站 channel 配置(写入Kafka)。

source: Overrides the `@Dependent` scope declared on the `@Mock` stereotype.
zh_cn: 对 `@Mock` stereotype上声明的 `@Dependent` 范围的覆盖。

source: PEM key format support
zh_cn: 支持Pem密钥格式

source: Package and run the application
zh_cn: 打包并运行该应用程序

source: Packaging and Running the application
zh_cn: 打包和运行应用程序

source: Packaging and run the application
zh_cn: 应用程序打包和运行

source: Packaging and running in JVM mode
zh_cn: 打包，并在JVM模式下运行

source: Packaging and running the application does not change either.
zh_cn: 打包和运行应用程序也不会改变。

source: Packaging of the application
zh_cn: 应用程序打包

source: Packaging the application
zh_cn: 打包应用

source: Packaging the native executable in a container
zh_cn: 将原生可执行文件打包到一个容器中

source: Paging
zh_cn: 分页

source: Panache allows you to write your MongoDB entities like this:
zh_cn: Panache允许你像这样写你的MongoDB实体：

source: Panache provides direct support for database locking with your entity/repository, using `findById(Object, LockModeType)` or `find().withLock(LockModeType)`.
zh_cn: Panache支持在实体类/Repository类中直接使用数据库的锁，可使用 `findById(Object, LockModeType)` 或 `find().withLock(LockModeType)` 方法。

source: Parse and Verify JsonWebToken with JWTParser
zh_cn: 用JWTParser解析和验证JsonWebToken

source: Path to TLS trusted certificate which may need to be configured if the keys have to be fetched over `HTTPS`.
zh_cn: 如果需要通过 `HTTPS` 获取密钥，则需要配置 TLS 信任证书的路径。

source: Path to the claim containing the groups. It starts from the top level JSON object and can contain multiple segments where each segment represents a JSON object name only, example: `realm/groups`. This property can be used if a token has no 'groups' claim but has the groups set in a different claim. Use double quotes with the namespace qualified claims.
zh_cn: 到包含组的声明的路径。它从顶级的JSON对象开始，可以包含多个段，每个段只代表一个JSON对象的名称，例如： `realm/groups` 。如果一个标记没有 `groups` 的声明，但在一个不同的声明中设置了组，就可以使用这个属性。在命名空间限定的声明上使用双引号。

source: Path to the claim containing the subject name. It starts from the top level JSON object and can contain multiple segments where each segment represents a JSON object name only, example: `realms/subject`. This property can be used if a token has no 'sub' claim but has the subject set in a different claim. Use double quotes with the namespace qualified claims.
zh_cn: 包含subject名称的声明的路径。它从顶级的JSON对象开始，可以包含多个段，每个段只代表一个JSON对象名称，例如： `realms/subject` 。如果一个标记没有 `sub` 声明，但在一个不同的声明里设置了subject，则可以使用这个属性。在命名空间限定的声明上使用双引号。

source: Path-specific authentication mechanisms
zh_cn: 特定路径认证机制

source: Payload can be wrapped inside `org.eclipse.microprofile.reactive.messaging.Message` to have more control on the written records:
zh_cn: Payload可以被封装在 `org.eclipse.microprofile.reactive.messaging.Message`，以便对写入的记录有更多的控制：

source: Permission paths and http root path
zh_cn: 权限路径和http根路径

source: Permission sets can also specify paths and methods as a comma separated list. If a path ends with `*` then it is considered to be a wildcard match and will match all sub paths, otherwise it is an exact match and will only match that specific path:
zh_cn: 权限集也可以用逗号分隔的列表来指定路径和方法。如果一个路径以 `*` 结尾，那么它被认为是通配符匹配，将匹配所有的子路径，否则它是精确匹配，只匹配这个特定路径：

source: Permissions are defined in config using permission sets. These are arbitrarily named permission grouping. Each permission set must specify a policy that is used to control access. There are three built-in policies: `deny`, `permit` and `authenticated`, which respectively permits all, denies all and only allows authenticated users.
zh_cn: 权限是在配置中使用权限集来定义。他们是任意命名的权限分组。每个权限集必须指定一个用于控制访问的策略。有三种内置策略。 `deny` , `permit` 和 `authenticated` ，分别是允许所有、拒绝所有和只允许认证的用户。

source: Permissions can be disabled at build time with an `enabled` property for each declared permission, for example:
zh_cn: 权限可以在构建时通过每个声明权限的 `enabled` 属性来禁用，例如：

source: Persist the entity. It returns a `Uni<Fruit>`.
zh_cn: 持久化该实体对象。它会返回一个 `Uni<Fruit>` 。

source: Persist the received `fruit` object.
zh_cn: 持久化接收到的 `fruit` 对象。

source: Persisting Kafka messages with Hibernate Reactive
zh_cn: 使用Hibernate Reactive持久化Kafka消息

source: Persisting Kafka messages with Hibernate with Panache
zh_cn: 用Hibernate与Panache来持久化Kafka消息

source: Platform
zh_cn: 平台

source: Please also see the <<add-smallrye-jwt, How to Add SmallRye JWT directly>> section about using `JWTParser` without the `HTTP` support provided by `quarkus-smallrye-jwt`.
zh_cn: 也请参见 link:#add-smallrye-jwt[如何直接添加SmallRye JWT] 部分，关于在没有 `quarkus-smallrye-jwt` 提供的 `HTTP` 支持的情况下使用 `JWTParser` 。

source: Please also see the <<integration-testing-keycloak-devservices, Dev Services for Keycloak>> section below about writing the integration tests which depend on `Dev Services for Keycloak`.
zh_cn: 关于编写依赖 `Keycloak开发服务` 的集成测试，也请参见下面的 link:#integration-testing-keycloak-devservices[Keycloak开发服务] 部分。

source: Please enable `io.quarkus.oidc.runtime.OidcProvider` `TRACE` level logging to see more details about the token verification errors:
zh_cn: 请启用 `io.quarkus.oidc.runtime.OidcProvider` `TRACE` 级日志，以查看有关令牌验证错误的更多细节：

source: Please enable `io.quarkus.oidc.runtime.OidcRecorder` `TRACE` level logging to see more details about the OidcProvider client initialization errors:
zh_cn: 请启用 `io.quarkus.oidc.runtime.OidcRecorder` `TRACE` 级日志，以查看关于OidcProvider客户端初始化错误的更多细节：

source: Please enable `io.quarkus.smallrye.jwt.runtime.auth.MpJwtValidator` `TRACE` level logging to see more details about the token verification or decryption errors:
zh_cn: 请启用 `io.quarkus.smallrye.jwt.runtime.auth.MpJwtValidator` `TRACE` 级日志，以查看有关令牌验证或解密错误的更多细节：

source: Please experiment with the default cache implementation or register a custom one.
zh_cn: 请尝试使用默认的缓存实现或注册一个自定义的缓存。

source: Please note that it's using the `MutinyRedis` class which does asynchronous calls to Redis.
zh_cn: 请注意，上述代码使用 `MutinyRedis` 类异步调用Redis命令

source: Please note that the Spring support in Quarkus does not start a Spring Application Context nor are any Spring infrastructure classes run. Spring classes and annotations are only used for reading metadata and / or are used as user code method return types or parameter types. What that means for end users, is that adding arbitrary Spring libraries will not have any effect. Moreover Spring infrastructure classes (like `org.springframework.beans.factory.config.BeanPostProcessor` for example) will not be executed.
zh_cn: 请注意，Quarkus中的Spring支持并不会启动Spring应用上下文，也不会运行任何Spring基础结构类。Spring类和注解仅用于读取元数据和 / 或作为用户代码的方法返回类型或参数类型。对于最终用户来说，这意味着添加任意Spring库都不会对程序有任何影响。此外，Spring基础类（例如 `org.springframework.beans.factory.config.BeanPostProcessor` ）将不会被执行。

source: Please note that the above command points to a floating tag. It is highly recommended to use the floating tag, so that your builder image remains up-to-date and secure. If you absolutely must, you may hard-code to a specific tag (see https://quay.io/repository/quarkus/ubi-quarkus-mandrel?tab=tags[here] for available tags), but be aware that you won't get security updates that way and it's unsupported.
zh_cn: 请注意，上述命令指向的是一个浮动标签。我们强烈建议你使用浮动标签，这样你的构建器镜像就能保持最新和安全。如果你一定要硬编码到一个特定的标签（参见 https://quay.io/repository/quarkus/ubi-quarkus-mandrel?tab=tags[这里] 的可用标签），但要注意，你不会得到安全更新，而且这不被支持。

source: Please read [CONTRIBUTING.md](https://github.com/quarkusio/quarkusio.github.io/blob/master/CONTRIBUTING.md) for details on our code of conduct, and the process for submitting pull requests to us.
zh_cn: 请参考 [CONTRIBUTING.md](https://github.com/quarkusio/quarkusio.github.io/blob/master/CONTRIBUTING.md) 关于我们的行为准则的细节，以及提交合并请求给我们的过程。

source: Please read the xref:security-openid-connect-multitenancy.adoc[Using OpenID Connect Multi-Tenancy] guide how to support multiple tenants.
zh_cn: 请阅读 xref:security-openid-connect-multitenancy.adoc[使用 OpenID Connect 多租户] ，来了解如何支持多租户。

source: Please read the xref:security-openid-connect-web-authentication.adoc[Using OpenID Connect to Protect Web Applications] guide if you need to authenticate and authorize the users using OpenID Connect Authorization Code Flow.
zh_cn: 如果你需要使用OpenID Connect授权码模式(Authorization Code Flow)来对用户进行认证和授权，请阅读 xref:security-openid-connect-web-authentication.adoc[使用OpenID Connect保护Web应用程序] 指南。

source: Please refer to the appropriate section depending on your context.
zh_cn: 请根据你的情况，参考适当的章节。

source: Please report any security issues you find in Quarkus to:
zh_cn: 请将您在Quarkus中发现的任何安全问题报告给：

source: Please see also <<redis-reference.adoc#custom_redis_commands,How to use custom Redis Commands>>.
zh_cn: 请参考 <<redis-reference.adoc#custom_redis_commands,如何使用自定义Redis命令>> 。

source: Please see link:https://download.eclipse.org/microprofile/microprofile-jwt-auth-1.2/microprofile-jwt-auth-spec-1.2.html#_cdi_injection_requirements[MP JWT CDI Injection Requirements] for more details.
zh_cn: 请参阅 link:https://download.eclipse.org/microprofile/microprofile-jwt-auth-1.2/microprofile-jwt-auth-spec-1.2.html#_cdi_injection_requirements[MP JWT CDI注入要求] 以了解更多细节。

source: Please see xref:native-and-ssl.adoc#working-with-containers[our Using SSL With Native Executables guide] for more information.
zh_cn: 更多信息请参见 xref:native-and-ssl.adoc#working-with-containers[我们的使用SSL与原生可执行文件指南] 。

source: Please see xref:security-openid-connect-client-reference.adoc#token-propagation[Token Propagation] section about the Bearer access token propagation to the downstream services.
zh_cn: 关于承载访问令牌向下游服务的传播，请参见 link:security-openid-connect-client.html#token-propagation[令牌] 传播部分。

source: Please see xref:security-openid-connect-client.adoc#token-propagation[Token Propagation] section about the Bearer access token propagation to the downstream services.
zh_cn: 关于不记名(Bearer)访问令牌向下游服务的传播，请参见 link:security-openid-connect-client.html#token-propagation[令牌传播] 部分。

source: Please see xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] for more information about the way it is initialized and configured.
zh_cn: 请参阅 link:security-openid-connect-dev-services.html[Keycloak开发服务] ，来了解更多关于它的初始化和配置方式的信息。

source: PostgreSQL Client
zh_cn: PostgreSQL 客户端

source: Prepare the REST test endpoint, set `application.properties`, for example:
zh_cn: 准备好REST测试端点，设置 `application.properties` ，例如：

source: Prerequisites
zh_cn: 先决条件

source: Principal Class
zh_cn: 主体类

source: Proactive Authentication
zh_cn: 主动认证

source: Proactive authentication
zh_cn: 主动认证

source: Processing Messages
zh_cn: 处理消息

source: Processing quote requests
zh_cn: 处理报价请求

source: Producing a native executable
zh_cn: 制作一个原生可执行文件

source: Producing a native executable can lead to a few issues, and so it's also a good idea to run some tests against the application running in the native file.
zh_cn: 制作一个原生可执行文件可能会导致一些问题，因此，针对在原生文件中运行的应用程序运行一些测试也是一个好主意。

source: Producing a native executable can lead to a few issues, and so it's also a good idea to run some tests against the application running in the native file. The reasoning is explained in the link:getting-started-testing#quarkus-integration-test[Testing Guide].
zh_cn: 制作一个原生可执行文件可能会导致一些问题，因此，建议针对以原生可执行文件运行的应用程序运行一些测试。具体原因在 link:getting-started-testing#quarkus-integration-test[测试指南] 中有详细解释。

source: Profiles
zh_cn: 环境配置(Profiles)

source: Programmatic Approach
zh_cn: 编程实现方法

source: Programmatically decide to set the transaction for rollback.
zh_cn: 以编程方式决定将该事务设置为回滚。

source: Project Homepage
zh_cn: 项目主页

source: Project Loom is coming to the JDK soon and proposes a virtual thread-based model. The Quarkus architecture is ready to support Loom as soon as it's become globally available.
zh_cn: Loom项目很快就会加入到JDK中，它提出了一个基于虚拟线程的模型。一旦在全局范围内可用，Quarkus架构就可以支持Loom。

source: Projection can be done for both PanacheQL and native queries.
zh_cn: 对PanacheQL和原生查询都可以进行映射。

source: Propagate incoming record key to the outgoing record Type: _boolean_
zh_cn: 是否将传入的记录键添加到传出的记录中 类型: _boolean_

source: Propagating Record Key
zh_cn: 传播记录键

source: Properties with default values can be configured in a configuration file just like any other property. However, the default value will be used if the property was not defined in a configuration file.
zh_cn: 具有默认值的属性可以像其他属性一样在配置文件中被配置。然而，如果该属性没有在配置文件中被定义，则将使用默认值。

source: Properties with optional values are the middle-ground between standard and properties with default values. While a missing property in a configuration file will not cause your application to fail, it will nevertheless not have a value set. We use `java.util.Optional` type to define such properties.
zh_cn: 具有可选值的属性处于标准属性和具有默认值属性之间的中间地带。尽管在配置文件中缺少一个属性不会导致你的应用程序启动失败，但它还是没有被设置一个值。我们使用 `java.util.Optional` 类型来定义这种属性。

source: Proven Java for the Cloud
zh_cn: 经过验证的云计算Java

source: Provide users with initial code for extensions when generating Quarkus applications on code.quarkus.io and all the Quarkus tooling. This guide explains how to create and configure a Codestart for an extension.
zh_cn: 当用户在 code.quarkus.io 和所有Quarkus工具上生成Quarkus应用程序时，为扩展提供初始代码。本指南解释如何为扩展创建和配置Codestart。

source: Provided by JBeret project
zh_cn: 由JBeret项目组提供

source: Provided by the JBeret Project Team
zh_cn: 由JBeret项目组提供

source: Provider Endpoint configuration
zh_cn: 提供者端点配置

source: Providing Redis Hosts Programmatically
zh_cn: 以编程方式设定Redis主机

source: Public Key Cryptography Standards #8 (PKCS#8) PEM
zh_cn: 公钥密码学标准#8（PKCS#8） PEM

source: Public Keys may be formatted in any of the following formats, specified in order of precedence:
zh_cn: 公钥可以采用以下任何一种格式，按优先顺序排列：

source: Publications
zh_cn: 发表

source: Pull Requests
zh_cn: 合并请求

source: QUARKUS GUIDES
zh_cn: QUARKUS指南

source: Quarkus - Supersonic Subatomic Java
zh_cn: Quarkus - 超音速 亚原子 Java

source: Quarkus 2.0 continues the mission of making Java the preferred framework for Kubernetes-native development with new developer tools and improved performance.
zh_cn: Quarkus 2.0继续致力于通过新的开发工具和改进的性能，使Java成为kubernetes原生开发的首选框架。

source: Quarkus Base Runtime Image
zh_cn: Quarkus运行时基础镜像

source: Quarkus Build Time Principle
zh_cn: Quarkus构建时原则

source: Quarkus Chat Options
zh_cn: Quarkus聊天选项

source: Quarkus Code Snippets
zh_cn: Quarkus代码片段

source: Quarkus DI solution is based on the [Contexts and Dependency Injection for Java 2.0](https://docs.jboss.org/cdi/spec/2.0/cdi-spec) specification. This guide explains the basics of CDI.
zh_cn: Quarkus DI解决方案是基于 [Java的上下文和依赖注入 2.0](https://docs.jboss.org/cdi/spec/2.0/cdi-spec) 规范。本指南解释了CDI的基础知识。

source: Quarkus Development
zh_cn: Quarkus 开发

source: Quarkus Extension for Apache Kafka
zh_cn: Apache Kafka Quarkus扩展

source: Quarkus Extension for Spring Scheduling API
zh_cn: Quarkus对SpringSpring Scheduling API 的扩展

source: Quarkus Features
zh_cn: Quarkus特性

source: Quarkus GitHub URL common base prefix.
zh_cn: Quarkus GitHub URL的通用基础前缀。

source: Quarkus Insights Podcast
zh_cn: Quarkus Insights 播客

source: Quarkus JBeret Extension
zh_cn: Quarkus JBeret扩展

source: Quarkus Kafka extension supports xref:deploying-to-kubernetes.adoc[Service Binding Specification for Kubernetes]. You can enable this by adding the `quarkus-kubernetes-service-binding` extension to your application.
zh_cn: Quarkus Kafka扩展支持 link:deploying-to-kubernetes.html[Kubernetes服务绑定规范] 。您可以通过添加 `quarkus-kubernetes-service-binding` 扩展来启用它。

source: Quarkus Micro Image?
zh_cn: 什么是Quarkus微镜像？

source: Quarkus Micrometer extensions are structured similarly to Micrometer itself: `quarkus-micrometer` provides core micrometer support and runtime integration and other Quarkus and Quarkiverse extensions bring in additional dependencies and requirements to support specific monitoring systems.
zh_cn: Quarkus Micrometer扩展的结构与Micrometer本身类似： `quarkus-micrometer` 提供核心Micrometer支持和运行时集成，其他Quarkus和Quarkiverse扩展提供额外的依赖和需求，以支持相应的监控系统。

source: Quarkus Newsletter
zh_cn: Quarkus 新闻

source: Quarkus OpenID Connect `quarkus-oidc` extension also supports Bearer Token Authorization and uses `smallrye-jwt` to represent the bearer tokens as `JsonWebToken`, please read the xref:security-openid-connect.adoc[Using OpenID Connect to Protect Service Applications] guide for more information. OpenID Connect extension has to be used if the Quarkus application needs to authenticate the users using OIDC Authorization Code Flow, please read xref:security-openid-connect-web-authentication.adoc[Using OpenID Connect to Protect Web Applications] guide for more information.
zh_cn: Quarkus OpenID Connect `quarkus-oidc` 扩展也支持不记名令牌验证(Bearer Token Authorization)，并使用 `smallrye-jwt` 把不记名令牌(bearer token)呈现为 `JsonWebToken` , 请阅读 link:security-openid-connect.html[使用 OpenID Connect 来保护服务应用程序] 指南来了解更多信息。如果Quarkus应用程序需要使用OIDC授权码模式(Authorization Code Flow)来对用户进行认证，就必须使用OpenID Connect扩展，请阅读《 link:security-openid-connect-web-authentication.html[使用OpenID Connect保护Web应用程序] 》指南了解更多信息。

source: Quarkus Security is a framework that provides the architecture, multiple authentication and authorization mechanisms, and other tools for you to build secure and production-quality Java applications.
zh_cn: Quarkus Security是一个框架，它提供了架构、多种认证和授权机制以及其他工具，用来为开发者提供构建达到生产级别安全性质量保证的Quarkus应用程序。

source: Quarkus Security is highly customizable. You can customize the following core security components of Quarkus:
zh_cn: Quarkus Security是高度可定制的。您可以定制Quarkus的以下核心安全组件：
